trade_exp/src/InformationRegisters/ОграниченияПоКолонкеОпт/ОграниченияПоКолонкеОпт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e1e1511d-d6f6-41c3-87f3-f3351094f58e">
  <name>ОграниченияПоКолонкеОпт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a102de1d-667d-4167-be2f-e8bdfab8323c">
    <name>ТСК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="87fba26b-ccf9-47fb-81a5-0317ea26b97f">
    <name>МД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d267f67-35a9-4a07-9c4d-9cfabcefffd4">
    <name>МДР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="6712634d-258d-44c7-a1b6-b7163d728d73">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="813cc93b-4a4b-4135-b2ed-f77cc748e8ef">
    <name>ДатаВнесения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c02350b-11fa-49a8-ac1c-074fcde34aec">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="e4292618-f06d-4b49-92d9-0dbfc6e7d4e5">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b89cd840-e3b8-4ce3-804c-99e3b16dfe0a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ОграниченияПоКолонкеОпт/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы()); 
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("Код", "строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("ТСК", "число#ТСК#10");
	СтруктураТаблицы.Вставить("МД", "число#МД#10");
	СтруктураТаблицы.Вставить("МДР", "число#МДР#10");

	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ОграниченияПоКолонкеОпт.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				если МенеджерЗаписи.МД>8 тогда
					МенеджерЗаписи.МД=8;
				конецесли;
				если МенеджерЗаписи.МД<4 тогда
					МенеджерЗаписи.МД=4;
				конецесли;
				если МенеджерЗаписи.ТСК>8 тогда
					МенеджерЗаписи.ТСК=8;
				конецесли;
				если МенеджерЗаписи.ТСК<4 тогда
					МенеджерЗаписи.ТСК=4;
				конецесли;
				если МенеджерЗаписи.МДР>8 тогда
					МенеджерЗаписи.МДР=8;
				конецесли;
				если МенеджерЗаписи.МДР<4 тогда
					МенеджерЗаписи.МДР=4;
				конецесли;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		//	Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;
Элементы.Список.Обновить();
КонецПроцедуры


#КонецОбласти
